jamwest/openwink/openwink-mcu-esp-idf/sdkconfig.defaults
# This file was generated and customized for ESP32-S3 projects using NimBLE.
# Place this in your project root. Other developers can run:
#   idf.py set-target esp32s3
#   idf.py defconfig
# to apply these defaults.

# --------------------------------------------------------------------
# Target
# --------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --------------------------------------------------------------------
# Bluetooth / NimBLE Configuration
# --------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_NIMBLE_CPP_IDF=1

# Use NimBLE host only (smaller footprint, better for BLE peripherals)
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n

# Use extended advertising
CONFIG_BT_NIMBLE_EXT_ADV=y

# Host stack size and task tuning
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_RPA_TIMEOUT=900

# Memory optimization for typical BLE peripheral roles
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y
CONFIG_BT_NIMBLE_MEM_ALLOC_IRAM_8BIT=n

# Controller config (shared with NimBLE)
CONFIG_BT_CONTROLLER_MODE_BLE_ONLY=y
CONFIG_BT_CONTROLLER_BLE_MAX_CONN_EFF=3
CONFIG_BT_CONTROLLER_BLE_MAX_ADV_INSTANCES=1
CONFIG_BT_CONTROLLER_BLE_ADV_DUP_FILT_EN=y
CONFIG_BT_CONTROLLER_BLE_SCAN_DUPL=y
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y

# --------------------------------------------------------------------
# Logging & System
# --------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Disable overly verbose logs from NimBLE
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y

# --------------------------------------------------------------------
# FreeRTOS / Stack
# --------------------------------------------------------------------
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_FREERTOS_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1

# --------------------------------------------------------------------
# Flash / Build Options
# --------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
